Revit 2027 API
DividedSurface.IsSeedNode Method
Reports whether a grid node is a "seed node," a node that is associated with one or more tiles.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSeedNode(
	GridNode gridNode
)
Public Function IsSeedNode (
	gridNode As GridNode
) As Boolean
public:
bool IsSeedNode(
	GridNode gridNode
)
member IsSeedNode :
        gridNode : GridNode -> bool
Parameters
gridNode GridNode
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when the grid node indexes are outside the range [ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ].
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace